Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13143.h
extern volatile PIR2bits_t PIR2bits __at(0x08E);
// bitfield macros
#define _PIR2_TMR2IF_POSN                                   0x2
#define _PIR2_TMR2IF_POSITION                               0x2
#define _PIR2_TMR2IF_SIZE                                   0x1
#define _PIR2_TMR2IF_LENGTH                                 0x1
#define _PIR2_TMR2IF_MASK                                   0x4
#define _PIR2_CCP1IF_POSN                                   0x5
#define _PIR2_CCP1IF_POSITION                               0x5
#define _PIR2_CCP1IF_SIZE                                   0x1
#define _PIR2_CCP1IF_LENGTH                                 0x1
#define _PIR2_CCP1IF_MASK                                   0x20
#define _PIR2_CCP2IF_POSN                                   0x6
#define _PIR2_CCP2IF_POSITION                               0x6
#define _PIR2_CCP2IF_SIZE                                   0x1
#define _PIR2_CCP2IF_LENGTH                                 0x1
#define _PIR2_CCP2IF_MASK                                   0x40

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x08F);
#ifndef _LIB_BUILD
asm("PIR3 equ 08Fh");
#endif

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x090);
#ifndef _LIB_BUILD
asm("PIR4 equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned CLC1IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned CLC3IF                 :1;
        unsigned CLC4IF                 :1;
        unsigned TX1IF                  :1;
        unsigned RC1IF                  :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x090);
// bitfield macros
#define _PIR4_CLC1IF_POSN                                   0x2
#define _PIR4_CLC1IF_POSITION                               0x2
#define _PIR4_CLC1IF_SIZE                                   0x1
#define _PIR4_CLC1IF_LENGTH                                 0x1
#define _PIR4_CLC1IF_MASK                                   0x4
#define _PIR4_CLC2IF_POSN                                   0x3
#define _PIR4_CLC2IF_POSITION                               0x3
#define _PIR4_CLC2IF_SIZE                                   0x1
#define _PIR4_CLC2IF_LENGTH                                 0x1
#define _PIR4_CLC2IF_MASK                                   0x8
#define _PIR4_CLC3IF_POSN                                   0x4
#define _PIR4_CLC3IF_POSITION                               0x4
#define _PIR4_CLC3IF_SIZE                                   0x1
#define _PIR4_CLC3IF_LENGTH                                 0x1
#define _PIR4_CLC3IF_MASK                                   0x10
#define _PIR4_CLC4IF_POSN                                   0x5
#define _PIR4_CLC4IF_POSITION                               0x5
#define _PIR4_CLC4IF_SIZE                                   0x1
#define _PIR4_CLC4IF_LENGTH                                 0x1
#define _PIR4_CLC4IF_MASK                                   0x20
#define _PIR4_TX1IF_POSN                                    0x6
#define _PIR4_TX1IF_POSITION                                0x6
#define _PIR4_TX1IF_SIZE                                    0x1
#define _PIR4_TX1IF_LENGTH                                  0x1
#define _PIR4_TX1IF_MASK                                    0x40
#define _PIR4_RC1IF_POSN                                    0x7
#define _PIR4_RC1IF_POSITION                                0x7
#define _PIR4_RC1IF_SIZE                                    0x1
#define _PIR4_RC1IF_LENGTH                                  0x1
#define _PIR4_RC1IF_MASK                                    0x80

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x091);
#ifndef _LIB_BUILD
asm("PIR5 equ 091h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned SSP1IF                 :1;
        unsigned BCL1IF                 :1;
        unsigned                        :2;
        unsigned CM1IF                  :1;
        unsigned CM2IF                  :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x091);
// bitfield macros
#define _PIR5_SSP1IF_POSN                                   0x2
#define _PIR5_SSP1IF_POSITION                               0x2
#define _PIR5_SSP1IF_SIZE                                   0x1
#define _PIR5_SSP1IF_LENGTH                                 0x1
#define _PIR5_SSP1IF_MASK                                   0x4
#define _PIR5_BCL1IF_POSN                                   0x3
#define _PIR5_BCL1IF_POSITION                               0x3
#define _PIR5_BCL1IF_SIZE                                   0x1
#define _PIR5_BCL1IF_LENGTH                                 0x1
#define _PIR5_BCL1IF_MASK                                   0x8
#define _PIR5_CM1IF_POSN                                    0x6
#define _PIR5_CM1IF_POSITION                                0x6
#define _PIR5_CM1IF_SIZE                                    0x1
#define _PIR5_CM1IF_LENGTH                                  0x1
#define _PIR5_CM1IF_MASK                                    0x40
#define _PIR5_CM2IF_POSN                                    0x7
#define _PIR5_CM2IF_POSITION                                0x7
#define _PIR5_CM2IF_SIZE                                    0x1
#define _PIR5_CM2IF_LENGTH                                  0x1
#define _PIR5_CM2IF_MASK                                    0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x092);
#ifndef _LIB_BUILD
asm("PIR6 equ 092h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x092);
// bitfield macros
#define _PIR6_ADIF_POSN                                     0x0
#define _PIR6_ADIF_POSITION                                 0x0
#define _PIR6_ADIF_SIZE                                     0x1
#define _PIR6_ADIF_LENGTH                                   0x1
#define _PIR6_ADIF_MASK                                     0x1
#define _PIR6_ADTIF_POSN                                    0x1
#define _PIR6_ADTIF_POSITION                                0x1
#define _PIR6_ADTIF_SIZE                                    0x1
#define _PIR6_ADTIF_LENGTH                                  0x1
#define _PIR6_ADTIF_MASK                                    0x2

