Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13143.h
// Register: CLBCLK
#define CLBCLK CLBCLK
extern volatile unsigned char           CLBCLK              __at(0x515);
#ifndef _LIB_BUILD
asm("CLBCLK equ 0515h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :4;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} CLBCLKbits_t;
extern volatile CLBCLKbits_t CLBCLKbits __at(0x515);
// bitfield macros
#define _CLBCLK_CLK_POSN                                    0x0
#define _CLBCLK_CLK_POSITION                                0x0
#define _CLBCLK_CLK_SIZE                                    0x4
#define _CLBCLK_CLK_LENGTH                                  0x4
#define _CLBCLK_CLK_MASK                                    0xF
#define _CLBCLK_CLK0_POSN                                   0x0
#define _CLBCLK_CLK0_POSITION                               0x0
#define _CLBCLK_CLK0_SIZE                                   0x1
#define _CLBCLK_CLK0_LENGTH                                 0x1
#define _CLBCLK_CLK0_MASK                                   0x1
#define _CLBCLK_CLK1_POSN                                   0x1
#define _CLBCLK_CLK1_POSITION                               0x1
#define _CLBCLK_CLK1_SIZE                                   0x1
#define _CLBCLK_CLK1_LENGTH                                 0x1
#define _CLBCLK_CLK1_MASK                                   0x2
#define _CLBCLK_CLK2_POSN                                   0x2
#define _CLBCLK_CLK2_POSITION                               0x2
#define _CLBCLK_CLK2_SIZE                                   0x1
#define _CLBCLK_CLK2_LENGTH                                 0x1
#define _CLBCLK_CLK2_MASK                                   0x4
#define _CLBCLK_CLK3_POSN                                   0x3
#define _CLBCLK_CLK3_POSITION                               0x3
#define _CLBCLK_CLK3_SIZE                                   0x1
#define _CLBCLK_CLK3_LENGTH                                 0x1
#define _CLBCLK_CLK3_MASK                                   0x8

// Register: CLBPPSCON4
#define CLBPPSCON4 CLBPPSCON4
extern volatile unsigned char           CLBPPSCON4          __at(0x516);
#ifndef _LIB_BUILD
asm("CLBPPSCON4 equ 0516h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OESEL6                 :4;
        unsigned OESEL7                 :4;
    };
} CLBPPSCON4bits_t;
extern volatile CLBPPSCON4bits_t CLBPPSCON4bits __at(0x516);
// bitfield macros
#define _CLBPPSCON4_OESEL6_POSN                             0x0
#define _CLBPPSCON4_OESEL6_POSITION                         0x0
#define _CLBPPSCON4_OESEL6_SIZE                             0x4
#define _CLBPPSCON4_OESEL6_LENGTH                           0x4
#define _CLBPPSCON4_OESEL6_MASK                             0xF
#define _CLBPPSCON4_OESEL7_POSN                             0x4
#define _CLBPPSCON4_OESEL7_POSITION                         0x4
#define _CLBPPSCON4_OESEL7_SIZE                             0x4
#define _CLBPPSCON4_OESEL7_LENGTH                           0x4
#define _CLBPPSCON4_OESEL7_MASK                             0xF0

// Register: CLBPPSCON3
#define CLBPPSCON3 CLBPPSCON3
extern volatile unsigned char           CLBPPSCON3          __at(0x517);
#ifndef _LIB_BUILD
asm("CLBPPSCON3 equ 0517h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OESEL4                 :4;
        unsigned OESEL5                 :4;
    };
} CLBPPSCON3bits_t;
extern volatile CLBPPSCON3bits_t CLBPPSCON3bits __at(0x517);
// bitfield macros
#define _CLBPPSCON3_OESEL4_POSN                             0x0
#define _CLBPPSCON3_OESEL4_POSITION                         0x0
#define _CLBPPSCON3_OESEL4_SIZE                             0x4
#define _CLBPPSCON3_OESEL4_LENGTH                           0x4
#define _CLBPPSCON3_OESEL4_MASK                             0xF
#define _CLBPPSCON3_OESEL5_POSN                             0x4
#define _CLBPPSCON3_OESEL5_POSITION                         0x4
#define _CLBPPSCON3_OESEL5_SIZE                             0x4
#define _CLBPPSCON3_OESEL5_LENGTH                           0x4
#define _CLBPPSCON3_OESEL5_MASK                             0xF0

// Register: CLBPPSCON2
#define CLBPPSCON2 CLBPPSCON2
extern volatile unsigned char           CLBPPSCON2          __at(0x518);
#ifndef _LIB_BUILD
asm("CLBPPSCON2 equ 0518h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OESEL2                 :4;
        unsigned OESEL3                 :4;
    };
} CLBPPSCON2bits_t;
extern volatile CLBPPSCON2bits_t CLBPPSCON2bits __at(0x518);
// bitfield macros
#define _CLBPPSCON2_OESEL2_POSN                             0x0
#define _CLBPPSCON2_OESEL2_POSITION                         0x0
#define _CLBPPSCON2_OESEL2_SIZE                             0x4
#define _CLBPPSCON2_OESEL2_LENGTH                           0x4
#define _CLBPPSCON2_OESEL2_MASK                             0xF
#define _CLBPPSCON2_OESEL3_POSN                             0x4
#define _CLBPPSCON2_OESEL3_POSITION                         0x4
#define _CLBPPSCON2_OESEL3_SIZE                             0x4
#define _CLBPPSCON2_OESEL3_LENGTH                           0x4
#define _CLBPPSCON2_OESEL3_MASK                             0xF0

// Register: CLBPPSCON1
#define CLBPPSCON1 CLBPPSCON1
extern volatile unsigned char           CLBPPSCON1          __at(0x519);
#ifndef _LIB_BUILD
asm("CLBPPSCON1 equ 0519h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OESEL0                 :4;
        unsigned OESEL1                 :4;
    };
} CLBPPSCON1bits_t;
extern volatile CLBPPSCON1bits_t CLBPPSCON1bits __at(0x519);
// bitfield macros
#define _CLBPPSCON1_OESEL0_POSN                             0x0
#define _CLBPPSCON1_OESEL0_POSITION                         0x0
#define _CLBPPSCON1_OESEL0_SIZE                             0x4
#define _CLBPPSCON1_OESEL0_LENGTH                           0x4
#define _CLBPPSCON1_OESEL0_MASK                             0xF
#define _CLBPPSCON1_OESEL1_POSN                             0x4
#define _CLBPPSCON1_OESEL1_POSITION                         0x4
#define _CLBPPSCON1_OESEL1_SIZE                             0x4
#define _CLBPPSCON1_OESEL1_LENGTH                           0x4
#define _CLBPPSCON1_OESEL1_MASK                             0xF0

