Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13143.h
// Register: DAC1CON
#define DAC1CON DAC1CON
extern volatile unsigned char           DAC1CON             __at(0x88C);
#ifndef _LIB_BUILD
asm("DAC1CON equ 088Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned PSS                    :2;
        unsigned OE                     :2;
        unsigned REFRNG                 :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned OE0                    :1;
        unsigned OE1                    :1;
    };
} DAC1CONbits_t;
extern volatile DAC1CONbits_t DAC1CONbits __at(0x88C);
// bitfield macros
#define _DAC1CON_PSS_POSN                                   0x2
#define _DAC1CON_PSS_POSITION                               0x2
#define _DAC1CON_PSS_SIZE                                   0x2
#define _DAC1CON_PSS_LENGTH                                 0x2
#define _DAC1CON_PSS_MASK                                   0xC
#define _DAC1CON_OE_POSN                                    0x4
#define _DAC1CON_OE_POSITION                                0x4
#define _DAC1CON_OE_SIZE                                    0x2
#define _DAC1CON_OE_LENGTH                                  0x2
#define _DAC1CON_OE_MASK                                    0x30
#define _DAC1CON_REFRNG_POSN                                0x6
#define _DAC1CON_REFRNG_POSITION                            0x6
#define _DAC1CON_REFRNG_SIZE                                0x1
#define _DAC1CON_REFRNG_LENGTH                              0x1
#define _DAC1CON_REFRNG_MASK                                0x40
#define _DAC1CON_EN_POSN                                    0x7
#define _DAC1CON_EN_POSITION                                0x7
#define _DAC1CON_EN_SIZE                                    0x1
#define _DAC1CON_EN_LENGTH                                  0x1
#define _DAC1CON_EN_MASK                                    0x80
#define _DAC1CON_PSS0_POSN                                  0x2
#define _DAC1CON_PSS0_POSITION                              0x2
#define _DAC1CON_PSS0_SIZE                                  0x1
#define _DAC1CON_PSS0_LENGTH                                0x1
#define _DAC1CON_PSS0_MASK                                  0x4
#define _DAC1CON_PSS1_POSN                                  0x3
#define _DAC1CON_PSS1_POSITION                              0x3
#define _DAC1CON_PSS1_SIZE                                  0x1
#define _DAC1CON_PSS1_LENGTH                                0x1
#define _DAC1CON_PSS1_MASK                                  0x8
#define _DAC1CON_OE0_POSN                                   0x4
#define _DAC1CON_OE0_POSITION                               0x4
#define _DAC1CON_OE0_SIZE                                   0x1
#define _DAC1CON_OE0_LENGTH                                 0x1
#define _DAC1CON_OE0_MASK                                   0x10
#define _DAC1CON_OE1_POSN                                   0x5
#define _DAC1CON_OE1_POSITION                               0x5
#define _DAC1CON_OE1_SIZE                                   0x1
#define _DAC1CON_OE1_LENGTH                                 0x1
#define _DAC1CON_OE1_MASK                                   0x20

// Register: DAC1DATL
#define DAC1DATL DAC1DATL
extern volatile unsigned char           DAC1DATL            __at(0x88D);
#ifndef _LIB_BUILD
asm("DAC1DATL equ 088Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :8;
    };
    struct {
        unsigned DAT                    :8;
    };
} DAC1DATLbits_t;
extern volatile DAC1DATLbits_t DAC1DATLbits __at(0x88D);
// bitfield macros
#define _DAC1DATL_DAC1R_POSN                                0x0
#define _DAC1DATL_DAC1R_POSITION                            0x0
#define _DAC1DATL_DAC1R_SIZE                                0x8
#define _DAC1DATL_DAC1R_LENGTH                              0x8
#define _DAC1DATL_DAC1R_MASK                                0xFF
#define _DAC1DATL_DAT_POSN                                  0x0
#define _DAC1DATL_DAT_POSITION                              0x0
#define _DAC1DATL_DAT_SIZE                                  0x8
#define _DAC1DATL_DAT_LENGTH                                0x8
#define _DAC1DATL_DAT_MASK                                  0xFF

// Register: NVMADR
#define NVMADR NVMADR
extern volatile unsigned short          NVMADR              __at(0x1C8C);
#ifndef _LIB_BUILD
asm("NVMADR equ 01C8Ch");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x1C8C);
#ifndef _LIB_BUILD
asm("NVMADRL equ 01C8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADR                 :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x1C8C);
// bitfield macros
#define _NVMADRL_NVMADR_POSN                                0x0
#define _NVMADRL_NVMADR_POSITION                            0x0
#define _NVMADRL_NVMADR_SIZE                                0x8
#define _NVMADRL_NVMADR_LENGTH                              0x8
#define _NVMADRL_NVMADR_MASK                                0xFF
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80

