Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13143.h
// Register: CRCSHFTT
#define CRCSHFTT CRCSHFTT
extern volatile unsigned char           CRCSHFTT            __at(0x1CA4);
#ifndef _LIB_BUILD
asm("CRCSHFTT equ 01CA4h");
#endif
// aliases
extern volatile unsigned char           CRCSHIFTT           __at(0x1CA4);
#ifndef _LIB_BUILD
asm("CRCSHIFTT equ 01CA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT24                :1;
        unsigned SHIFT25                :1;
        unsigned SHIFT26                :1;
        unsigned SHIFT27                :1;
        unsigned SHIFT28                :1;
        unsigned SHIFT29                :1;
        unsigned SHIFT30                :1;
        unsigned SHIFT31                :1;
    };
} CRCSHFTTbits_t;
extern volatile CRCSHFTTbits_t CRCSHFTTbits __at(0x1CA4);
// bitfield macros
#define _CRCSHFTT_SHIFT_POSN                                0x0
#define _CRCSHFTT_SHIFT_POSITION                            0x0
#define _CRCSHFTT_SHIFT_SIZE                                0x8
#define _CRCSHFTT_SHIFT_LENGTH                              0x8
#define _CRCSHFTT_SHIFT_MASK                                0xFF
#define _CRCSHFTT_SHIFT24_POSN                              0x0
#define _CRCSHFTT_SHIFT24_POSITION                          0x0
#define _CRCSHFTT_SHIFT24_SIZE                              0x1
#define _CRCSHFTT_SHIFT24_LENGTH                            0x1
#define _CRCSHFTT_SHIFT24_MASK                              0x1
#define _CRCSHFTT_SHIFT25_POSN                              0x1
#define _CRCSHFTT_SHIFT25_POSITION                          0x1
#define _CRCSHFTT_SHIFT25_SIZE                              0x1
#define _CRCSHFTT_SHIFT25_LENGTH                            0x1
#define _CRCSHFTT_SHIFT25_MASK                              0x2
#define _CRCSHFTT_SHIFT26_POSN                              0x2
#define _CRCSHFTT_SHIFT26_POSITION                          0x2
#define _CRCSHFTT_SHIFT26_SIZE                              0x1
#define _CRCSHFTT_SHIFT26_LENGTH                            0x1
#define _CRCSHFTT_SHIFT26_MASK                              0x4
#define _CRCSHFTT_SHIFT27_POSN                              0x3
#define _CRCSHFTT_SHIFT27_POSITION                          0x3
#define _CRCSHFTT_SHIFT27_SIZE                              0x1
#define _CRCSHFTT_SHIFT27_LENGTH                            0x1
#define _CRCSHFTT_SHIFT27_MASK                              0x8
#define _CRCSHFTT_SHIFT28_POSN                              0x4
#define _CRCSHFTT_SHIFT28_POSITION                          0x4
#define _CRCSHFTT_SHIFT28_SIZE                              0x1
#define _CRCSHFTT_SHIFT28_LENGTH                            0x1
#define _CRCSHFTT_SHIFT28_MASK                              0x10
#define _CRCSHFTT_SHIFT29_POSN                              0x5
#define _CRCSHFTT_SHIFT29_POSITION                          0x5
#define _CRCSHFTT_SHIFT29_SIZE                              0x1
#define _CRCSHFTT_SHIFT29_LENGTH                            0x1
#define _CRCSHFTT_SHIFT29_MASK                              0x20
#define _CRCSHFTT_SHIFT30_POSN                              0x6
#define _CRCSHFTT_SHIFT30_POSITION                          0x6
#define _CRCSHFTT_SHIFT30_SIZE                              0x1
#define _CRCSHFTT_SHIFT30_LENGTH                            0x1
#define _CRCSHFTT_SHIFT30_MASK                              0x40
#define _CRCSHFTT_SHIFT31_POSN                              0x7
#define _CRCSHFTT_SHIFT31_POSITION                          0x7
#define _CRCSHFTT_SHIFT31_SIZE                              0x1
#define _CRCSHFTT_SHIFT31_LENGTH                            0x1
#define _CRCSHFTT_SHIFT31_MASK                              0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT24                :1;
        unsigned SHIFT25                :1;
        unsigned SHIFT26                :1;
        unsigned SHIFT27                :1;
        unsigned SHIFT28                :1;
        unsigned SHIFT29                :1;
        unsigned SHIFT30                :1;
        unsigned SHIFT31                :1;
    };
} CRCSHIFTTbits_t;
extern volatile CRCSHIFTTbits_t CRCSHIFTTbits __at(0x1CA4);
// bitfield macros
#define _CRCSHIFTT_SHIFT_POSN                               0x0
#define _CRCSHIFTT_SHIFT_POSITION                           0x0
#define _CRCSHIFTT_SHIFT_SIZE                               0x8
#define _CRCSHIFTT_SHIFT_LENGTH                             0x8
#define _CRCSHIFTT_SHIFT_MASK                               0xFF
#define _CRCSHIFTT_SHIFT24_POSN                             0x0
#define _CRCSHIFTT_SHIFT24_POSITION                         0x0
#define _CRCSHIFTT_SHIFT24_SIZE                             0x1
#define _CRCSHIFTT_SHIFT24_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT24_MASK                             0x1
#define _CRCSHIFTT_SHIFT25_POSN                             0x1
#define _CRCSHIFTT_SHIFT25_POSITION                         0x1
#define _CRCSHIFTT_SHIFT25_SIZE                             0x1
#define _CRCSHIFTT_SHIFT25_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT25_MASK                             0x2
#define _CRCSHIFTT_SHIFT26_POSN                             0x2
#define _CRCSHIFTT_SHIFT26_POSITION                         0x2
#define _CRCSHIFTT_SHIFT26_SIZE                             0x1
#define _CRCSHIFTT_SHIFT26_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT26_MASK                             0x4
#define _CRCSHIFTT_SHIFT27_POSN                             0x3
#define _CRCSHIFTT_SHIFT27_POSITION                         0x3
#define _CRCSHIFTT_SHIFT27_SIZE                             0x1
#define _CRCSHIFTT_SHIFT27_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT27_MASK                             0x8
#define _CRCSHIFTT_SHIFT28_POSN                             0x4
#define _CRCSHIFTT_SHIFT28_POSITION                         0x4
#define _CRCSHIFTT_SHIFT28_SIZE                             0x1
#define _CRCSHIFTT_SHIFT28_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT28_MASK                             0x10
#define _CRCSHIFTT_SHIFT29_POSN                             0x5
#define _CRCSHIFTT_SHIFT29_POSITION                         0x5
#define _CRCSHIFTT_SHIFT29_SIZE                             0x1
#define _CRCSHIFTT_SHIFT29_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT29_MASK                             0x20
#define _CRCSHIFTT_SHIFT30_POSN                             0x6
#define _CRCSHIFTT_SHIFT30_POSITION                         0x6
#define _CRCSHIFTT_SHIFT30_SIZE                             0x1
#define _CRCSHIFTT_SHIFT30_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT30_MASK                             0x40
#define _CRCSHIFTT_SHIFT31_POSN                             0x7
#define _CRCSHIFTT_SHIFT31_POSITION                         0x7
#define _CRCSHIFTT_SHIFT31_SIZE                             0x1
#define _CRCSHIFTT_SHIFT31_LENGTH                           0x1
#define _CRCSHIFTT_SHIFT31_MASK                             0x80

